controllers/PassportController.php

    public function actionIndex()
    {
		// Get all agent data
		$agent = PassportDetails::find()->all();
		$agent_name = array();
		if(!empty($agent))
		{
			foreach($agent as $rec)
			{
				if($rec->agency_name != '' && !in_array($rec->agency_name,$agent_name))
					$agent_name[] = $rec->agency_name;
				if($rec->agent_name != '' && !in_array($rec->agent_name,$agent_name))
					$agent_name[] = $rec->agent_name;
				if($rec->delivered_agent_name != '' && !in_array($rec->delivered_agent_name,$agent_name))
					$agent_name[] = $rec->delivered_agent_name;
			}
			Yii::$app->session['Agents'] = $agent_name;

		}
		if(Yii::$app->request->post('search_passport'))
		{
			$alldata = PassportDetails::find()->where(['like', 'pass_number', Yii::$app->request->post('search_passport')])->all();
			$pagination = '';

		}
		else
		{
			$per_page = 10;
			$page = (isset($_REQUEST['page']) ? $_REQUEST['page'] : 1); //echo $page; exit;
			$startpoint = ($page * $per_page) - $per_page;
			$alldata = PassportDetails::find()->limit($per_page)->offset($startpoint)->all();
---
SELECT * FROM `passport_details` WHERE given_name LIKE '%''a''%'
SELECT * FROM `passport_details` LIMIT 10

	public function actionView($pass_id)
	{
		if(isset($pass_id) && $pass_id != '')
		{
			$PassportDetail = PassportDetails::findOne(['pass_id' => $pass_id]);
---
SELECT * FROM `passport_details` WHERE `pass_id`='78'