controllers/ReportsController.php

SELECT * FROM `passport_details`
---
    public function actionIndex()
    {
        // Get all agent data
		$agent = PassportDetails::find()->all();