controllers/UsersController.php

    public function actionIndex()
    {
        if(Yii::$app->session['user_role'] != 1)
		{
			return $this->redirect(['site/index']);
		}
		else
		{
			$users = Users::find()->where('user_id != :user_id',['user_id' => 1])->all();
---
SELECT * FROM `users` WHERE user_id != 1